```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/58f69585-b46d-4539-aa6c-6e56452ab564/terraform-bin state list
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.resource_group.azurerm_resource_group.this
module.traffic_manager.azurerm_traffic_manager_external_endpoint.this
module.traffic_manager.azurerm_traffic_manager_profile.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
::debug::Terraform exited with code 0.
::debug::stdout: module.acr.data.azurerm_container_registry_scope_map.pull%0Amodule.acr.data.azurerm_container_registry_scope_map.push%0Amodule.acr.azurerm_container_registry.this%0Amodule.acr.azurerm_container_registry_token.pull%0Amodule.acr.azurerm_container_registry_token.push%0Amodule.acr.azurerm_container_registry_token_password.pull_password%0Amodule.acr.azurerm_container_registry_token_password.push_password%0Amodule.acr.azurerm_private_dns_a_record.data%0Amodule.acr.azurerm_private_dns_a_record.login_server%0Amodule.acr.azurerm_private_dns_zone.pdz%0Amodule.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private%0Amodule.acr.azurerm_private_endpoint.pep%0Amodule.acr.azurerm_subnet.acr%0Amodule.acr.azurerm_subnet.container_apps%0Amodule.acr.azurerm_virtual_network.vnet%0Amodule.container_apps.azurerm_application_insights.this%0Amodule.docker_image.docker_image.proxy%0Amodule.docker_image.docker_registry_image.proxy%0Amodule.docker_image.null_resource.go_code_keeper%0Amodule.resource_group.azurerm_resource_group.this%0Amodule.traffic_manager.azurerm_traffic_manager_external_endpoint.this%0Amodule.traffic_manager.azurerm_traffic_manager_profile.this%0Amodule.acr.module.public_ip.data.curl.big_data_cloud%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env%0Amodule.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]%0A
::debug::stderr: 
::debug::exitcode: 0
[command]/usr/local/vss-agent/2.309.0/_work/_temp/58f69585-b46d-4539-aa6c-6e56452ab564/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id       = "sha256:ff6269e5c0f06d3a8586e005e12ec00a8508ac430fff849a0f11a9142acfff16avmtelemetry.azurecr.io/telemetry_proxy"
      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash" = "b49c3f11e0f8641261e42ae428a8a9ad"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
        }
    }

  # module.endpoint_blob.azurerm_storage_account.endpoint will be created
  + resource "azurerm_storage_account" "endpoint" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "GRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "avmtftelemetrysvc"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "eastus"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.endpoint_blob.azurerm_storage_blob.endpoint will be created
  + resource "azurerm_storage_blob" "endpoint" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "endpoint"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "https://telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io"
      + storage_account_name   = "avmtftelemetrysvc"
      + storage_container_name = "blob"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.endpoint_blob.azurerm_storage_container.endpoint will be created
  + resource "azurerm_storage_container" "endpoint" {
      + container_access_type   = "blob"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "blob"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "avmtftelemetrysvc"
    }

  # module.traffic_manager.azurerm_traffic_manager_external_endpoint.this will be destroyed
  # (because azurerm_traffic_manager_external_endpoint.this is not in configuration)
  - resource "azurerm_traffic_manager_external_endpoint" "this" {
      - enabled           = true -> null
      - endpoint_location = "East US" -> null
      - geo_mappings      = [] -> null
      - id                = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc/ExternalEndpoints/endpoint" -> null
      - name              = "endpoint" -> null
      - priority          = 1 -> null
      - profile_id        = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc" -> null
      - target            = "telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io" -> null
      - weight            = 100 -> null
    }

  # module.traffic_manager.azurerm_traffic_manager_profile.this will be destroyed
  # (because azurerm_traffic_manager_profile.this is not in configuration)
  - resource "azurerm_traffic_manager_profile" "this" {
      - fqdn                   = "avmtftelemetry.trafficmanager.net" -> null
      - id                     = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc" -> null
      - max_return             = 0 -> null
      - name                   = "tfmodtelemetry-svc" -> null
      - profile_status         = "Enabled" -> null
      - resource_group_name    = "avm-telemetry" -> null
      - tags                   = {} -> null
      - traffic_routing_method = "Performance" -> null
      - traffic_view_enabled   = false -> null

      - dns_config {
          - relative_name = "avmtftelemetry" -> null
          - ttl           = 600 -> null
        }

      - monitor_config {
          - expected_status_code_ranges  = [
              - "200-202",
            ] -> null
          - interval_in_seconds          = 30 -> null
          - path                         = "/telemetry" -> null
          - port                         = 443 -> null
          - protocol                     = "HTTPS" -> null
          - timeout_in_seconds           = 10 -> null
          - tolerated_number_of_failures = 3 -> null
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + endpoint_blob_url  = (known after apply)
  - telemetry_endpoint = "avmtftelemetry.trafficmanager.net" -> null
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.docker_image.docker_image.proxy has been deleted%0A  - resource "docker_image" "proxy" {%0A        id       = "sha256:ff6269e5c0f06d3a8586e005e12ec00a8508ac430fff849a0f11a9142acfff16avmtelemetry.azurecr.io/telemetry_proxy"%0A      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (2 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash" = "b49c3f11e0f8641261e42ae428a8a9ad"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = [%0A              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",%0A            ]%0A        }%0A    }%0A%0A  # module.endpoint_blob.azurerm_storage_account.endpoint will be created%0A  + resource "azurerm_storage_account" "endpoint" {%0A      + access_tier                       = (known after apply)%0A      + account_kind                      = "StorageV2"%0A      + account_replication_type          = "GRS"%0A      + account_tier                      = "Standard"%0A      + allow_nested_items_to_be_public   = true%0A      + cross_tenant_replication_enabled  = true%0A      + default_to_oauth_authentication   = false%0A      + enable_https_traffic_only         = true%0A      + id                                = (known after apply)%0A      + infrastructure_encryption_enabled = false%0A      + is_hns_enabled                    = false%0A      + large_file_share_enabled          = (known after apply)%0A      + location                          = "eastus"%0A      + min_tls_version                   = "TLS1_2"%0A      + name                              = "avmtftelemetrysvc"%0A      + nfsv3_enabled                     = false%0A      + primary_access_key                = (sensitive value)%0A      + primary_blob_connection_string    = (sensitive value)%0A      + primary_blob_endpoint             = (known after apply)%0A      + primary_blob_host                 = (known after apply)%0A      + primary_connection_string         = (sensitive value)%0A      + primary_dfs_endpoint              = (known after apply)%0A      + primary_dfs_host                  = (known after apply)%0A      + primary_file_endpoint             = (known after apply)%0A      + primary_file_host                 = (known after apply)%0A      + primary_location                  = (known after apply)%0A      + primary_queue_endpoint            = (known after apply)%0A      + primary_queue_host                = (known after apply)%0A      + primary_table_endpoint            = (known after apply)%0A      + primary_table_host                = (known after apply)%0A      + primary_web_endpoint              = (known after apply)%0A      + primary_web_host                  = (known after apply)%0A      + public_network_access_enabled     = true%0A      + queue_encryption_key_type         = "Service"%0A      + resource_group_name               = "eastus"%0A      + secondary_access_key              = (sensitive value)%0A      + secondary_blob_connection_string  = (sensitive value)%0A      + secondary_blob_endpoint           = (known after apply)%0A      + secondary_blob_host               = (known after apply)%0A      + secondary_connection_string       = (sensitive value)%0A      + secondary_dfs_endpoint            = (known after apply)%0A      + secondary_dfs_host                = (known after apply)%0A      + secondary_file_endpoint           = (known after apply)%0A      + secondary_file_host               = (known after apply)%0A      + secondary_location                = (known after apply)%0A      + secondary_queue_endpoint          = (known after apply)%0A      + secondary_queue_host              = (known after apply)%0A      + secondary_table_endpoint          = (known after apply)%0A      + secondary_table_host              = (known after apply)%0A      + secondary_web_endpoint            = (known after apply)%0A      + secondary_web_host                = (known after apply)%0A      + sftp_enabled                      = false%0A      + shared_access_key_enabled         = true%0A      + table_encryption_key_type         = "Service"%0A%0A      + network_rules {%0A          + bypass                     = (known after apply)%0A          + default_action             = "Allow"%0A          + ip_rules                   = (known after apply)%0A          + virtual_network_subnet_ids = (known after apply)%0A        }%0A    }%0A%0A  # module.endpoint_blob.azurerm_storage_blob.endpoint will be created%0A  + resource "azurerm_storage_blob" "endpoint" {%0A      + access_tier            = (known after apply)%0A      + content_type           = "text/plain"%0A      + id                     = (known after apply)%0A      + metadata               = (known after apply)%0A      + name                   = "endpoint"%0A      + parallelism            = 8%0A      + size                   = 0%0A      + source_content         = "https://telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io"%0A      + storage_account_name   = "avmtftelemetrysvc"%0A      + storage_container_name = "blob"%0A      + type                   = "Block"%0A      + url                    = (known after apply)%0A    }%0A%0A  # module.endpoint_blob.azurerm_storage_container.endpoint will be created%0A  + resource "azurerm_storage_container" "endpoint" {%0A      + container_access_type   = "blob"%0A      + has_immutability_policy = (known after apply)%0A      + has_legal_hold          = (known after apply)%0A      + id                      = (known after apply)%0A      + metadata                = (known after apply)%0A      + name                    = "blob"%0A      + resource_manager_id     = (known after apply)%0A      + storage_account_name    = "avmtftelemetrysvc"%0A    }%0A%0A  # module.traffic_manager.azurerm_traffic_manager_external_endpoint.this will be destroyed%0A  # (because azurerm_traffic_manager_external_endpoint.this is not in configuration)%0A  - resource "azurerm_traffic_manager_external_endpoint" "this" {%0A      - enabled           = true -> null%0A      - endpoint_location = "East US" -> null%0A      - geo_mappings      = [] -> null%0A      - id                = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc/ExternalEndpoints/endpoint" -> null%0A      - name              = "endpoint" -> null%0A      - priority          = 1 -> null%0A      - profile_id        = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc" -> null%0A      - target            = "telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io" -> null%0A      - weight            = 100 -> null%0A    }%0A%0A  # module.traffic_manager.azurerm_traffic_manager_profile.this will be destroyed%0A  # (because azurerm_traffic_manager_profile.this is not in configuration)%0A  - resource "azurerm_traffic_manager_profile" "this" {%0A      - fqdn                   = "avmtftelemetry.trafficmanager.net" -> null%0A      - id                     = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Network/trafficManagerProfiles/tfmodtelemetry-svc" -> null%0A      - max_return             = 0 -> null%0A      - name                   = "tfmodtelemetry-svc" -> null%0A      - profile_status         = "Enabled" -> null%0A      - resource_group_name    = "avm-telemetry" -> null%0A      - tags                   = {} -> null%0A      - traffic_routing_method = "Performance" -> null%0A      - traffic_view_enabled   = false -> null%0A%0A      - dns_config {%0A          - relative_name = "avmtftelemetry" -> null%0A          - ttl           = 600 -> null%0A        }%0A%0A      - monitor_config {%0A          - expected_status_code_ranges  = [%0A              - "200-202",%0A            ] -> null%0A          - interval_in_seconds          = 30 -> null%0A          - path                         = "/telemetry" -> null%0A          - port                         = 443 -> null%0A          - protocol                     = "HTTPS" -> null%0A          - timeout_in_seconds           = 10 -> null%0A          - tolerated_number_of_failures = 3 -> null%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  + endpoint_blob_url  = (known after apply)%0A  - telemetry_endpoint = "avmtftelemetry.trafficmanager.net" -> null%0A
::debug::stderr: 
::debug::exitcode: 0

```